АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_КубатурникКруглогоЛеса/алк_КубатурникКруглогоЛеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_КубатурникКруглогоЛеса</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДлинаМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СечениеМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКубатурника</name>
    <type>
      <types>EnumRef.алк_ТипыКубатурников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ВидыСечений/ВидыСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСечений</name>
  <enumValues>
    <name>Квадратное</name>
  </enumValues>
  <enumValues>
    <name>Круглое</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ТипыКубатурников/алк_ТипыКубатурников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипыКубатурников</name>
  <enumValues>
    <name>ГОСТ_270875</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись из ЭтотОбъект Цикл
		Сч = 0;
		//Запись = ЭтотОбъект[0];
		ВозможенРасчетОбъема = Истина;
		Если ЗначениеЗаполнено(Запись["Порода"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись["Сорт"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		Если ЗначениеЗаполнено(Запись["Длина"]) Тогда
			Сч = Сч + 1;
		Иначе
			ВозможенРасчетОбъема = Ложь;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Запись["Сечение"]) Тогда
			Сч = Сч + 1;
		Иначе
			ВозможенРасчетОбъема = Ложь;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Запись["Влажность"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Запись["Поверхность"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли;

		Запись.КоличествоРеквизитов = Сч;
		
		Если ВозможенРасчетОбъема тогда 
			
			Если Запись.Характеристика.Владелец.Код = "ПБ-00000022" Тогда    // для поддонов объем приравнимаем к 1				
				Запись.Объем = 1;
			Иначе 	
				РеквизитыСечения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись["Сечение"], "ВидСечения,ШиринаММ,ТолщинаММ,ДиаметрММ");
				ДлинаММ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись["Длина"], "ДлинаММ"); 
				
				Если Запись.Характеристика.Владелец.Код = "ПБ-00000006" Тогда  //Карандаш
					Запись.Объем = 3.14 * ДлинаММ / 1000 * Pow((РеквизитыСечения.ДиаметрММ / 2000),2);				
				Иначе 
					Если РеквизитыСечения.ВидСечения = Перечисления.ВидыСечений.Квадратное тогда	
						Запись.Объем = РеквизитыСечения.ТолщинаММ * РеквизитыСечения.ШиринаММ * ДлинаММ / 1000000000;
					Иначе //если сечение круглое
						Запись.Объем = РегистрыСведений.алк_КубатурникКруглогоЛеса.ПолучитьЗначениеОбъема(ДлинаММ / 1000, РеквизитыСечения.ДиаметрММ / 1000, Перечисления.алк_ТипыКубатурников.ГОСТ_270875);
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
